style_share/app/controllers/sketch_controller.rb

SELECT "sketches".* FROM "sketches" ORDER BY "sketches"."created_at" DESC LIMIT $1  [["LIMIT", 3]]
---
    def show
        @sketches = Sketch.order(created_at: :asc).last(3)