style_share_2/app/controllers/sketches_controller.rb

  def index
    @sketches = Sketch.all
---
SELECT "sketches".* FROM "sketches"

  def create
    @sketch = Sketch.new(sketch_params)
    @sketch.code = @sketch.code.strip
    if @sketch.save
---
INSERT INTO "sketches" ("description", "code") VALUES ($1, $2) RETURNING "id"  [["description", "hbfsk"], ["code", ""]]

    def set_sketch
      @sketch = Sketch.find(params[:id])
---
SELECT "sketches".* FROM "sketches" WHERE "sketches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]